
# -------------------------------------------------------------------
# Вводные данные
arr = [339, 353, 377, 349, 394, 385, 395, 389, 353, 405, 365, 310, 395, 368, 361, 383, 401, 398, 401, 388, 408, 388, 417, 375]
alpha = 0.01
# -------------------------------------------------------------------
# Инициализирующиеся данные
N = len(arr) # Выборка
print(N)
k = N-1 # Число степеней свободы
# -------------------------------------------------------------------
xAriphmetic = sum(arr)/len(arr)
print("Среднее арифметическое:", xAriphmetic)

sSelective = sum([(i - xAriphmetic)**2 for i in arr])/N
print("Выборочкая дисперсия:", sSelective)

S = (N/(N-1))*sSelective
print("Исправленная дисперсия:", S)
print("Корень из испр. дисп.:", S**(1/2))

